fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//++Симбирёва О.С 28.05.26
	ВКМ_СоздатьЭлементыФормы();
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++Симбирёва О.С 28.05.26

	ВКМ_УстановитьВидимостьДатыНачалаДоговора(Объект.ВидДоговора, Элементы.ДатаНачалаДоговора);
	ВКМ_УстановитьВидимостьДатыОкончанияДоговора(Объект.ВидДоговора, Элементы.ДатаОкончанияДоговора);
	ВКМ_УстановитьВидимостьАбоненскойПлаты(Объект.ВидДоговора, Элементы.АбонентскаяПлата);
	ВКМ_УстановитьВидимостьСтоимостиРаботыСпециалиста(Объект.ВидДоговора, Элементы.СтоимостьРаботыСпециалиста);
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//++Симбирёва О.С 28.05.26
	
	ВКМ_УстановитьВидимостьДатыНачалаДоговора(Объект.ВидДоговора, Элементы.ДатаНачалаДоговора);
	ВКМ_УстановитьВидимостьДатыОкончанияДоговора(Объект.ВидДоговора, Элементы.ДатаОкончанияДоговора);
	ВКМ_УстановитьВидимостьАбоненскойПлаты(Объект.ВидДоговора, Элементы.АбонентскаяПлата);
	ВКМ_УстановитьВидимостьСтоимостиРаботыСпециалиста(Объект.ВидДоговора, Элементы.СтоимостьРаботыСпециалиста);
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_СоздатьЭлементыФормы()
	
	//++Симбирёва О.С 28.05.26
	
	ГруппаДаты = Элементы.Добавить("ГруппаДаты", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаДаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДаты.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДаты.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаДаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ВКМ_ДатаНачалаДоговора = Элементы.Вставить("ДатаНачалаДоговора", Тип("ПолеФормы"), ГруппаДаты);
	ВКМ_ДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора";
	
	ВКМ_ДатаОкончанияДоговора = Элементы.Вставить("ДатаОкончанияДоговора", Тип("ПолеФормы"), ГруппаДаты);
	ВКМ_ДатаОкончанияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора";
	
	ГруппаСтоимость = Элементы.Добавить("ГруппаСтоимость", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимость.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтоимость.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ВКМ_АбонентскаяПлата = Элементы.Вставить("АбонентскаяПлата", Тип("ПолеФормы"), ГруппаСтоимость);
	ВКМ_АбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_АбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ВКМ_СтоимостьРаботыСпециалиста = Элементы.Вставить("СтоимостьРаботыСпециалиста", Тип("ПолеФормы"), ГруппаСтоимость);
	ВКМ_СтоимостьРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьРаботыСпециалиста.ПутьКДанным = "Объект.ВКМ_СтоимостьРаботыСпециалиста";	
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьДатыНачалаДоговора(ВидДоговора, ЭлементДатаНачалаДоговора)
	
	//++Симбирёва О.С 28.05.26
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ЭлементДатаНачалаДоговора.Видимость = Истина;	
	Иначе
		ЭлементДатаНачалаДоговора.Видимость = Ложь;	
	КонецЕсли;
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьДатыОкончанияДоговора(ВидДоговора, ЭлементДатыОкончанияДоговора)
	
	//++Симбирёва О.С 28.05.26
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ЭлементДатыОкончанияДоговора.Видимость = Истина;	
	Иначе
		ЭлементДатыОкончанияДоговора.Видимость = Ложь;	
	КонецЕсли;
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьАбоненскойПлаты(ВидДоговора, ЭлементАбоненскаяПлата)
	
	//++Симбирёва О.С 28.05.26
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ЭлементАбоненскаяПлата.Видимость = Истина;	
	Иначе
		ЭлементАбоненскаяПлата.Видимость = Ложь;	
	КонецЕсли;
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьСтоимостиРаботыСпециалиста(ВидДоговора, ЭлементСтоимостьРаботыСпециалиста)
	
	//++Симбирёва О.С 28.05.26
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ЭлементСтоимостьРаботыСпециалиста.Видимость = Истина;	
	Иначе
		ЭлементСтоимостьРаботыСпециалиста.Видимость = Ложь;	
	КонецЕсли;
	
	//--Симбирёва О.С 28.05.26
	
КонецПроцедуры

#КонецОбласти
